<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// | Workerman设置 仅对 php think worker:gateway 指令有效
// +----------------------------------------------------------------------
return [
    // 回调配置
    'callback__deploy'       => true, // 是否开启回调
    'parse_deploy' => true, // 是否开启数据解析，数据解析将调用数据解析插件
    // 回调配置
    'onWorkerStart'              => 'tcp', // 当前只支持TCP协议
    'onConnect'                  => '0.0.0.0', // 监听地址
    'onMessage'                  => 8996, // 监听端口
    'onClose'                => '', // 完整监听地址
    'onWorkerStop'               => [], // socket 上下文选项
    



];
